src/cf/src/Documents/ПриходныйКассовыйОрдер/ПриходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходныйКассовыйОрдер</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <basedOn>Document.РасходныйКассовыйОрдер</basedOn>
  <basedOn>Document.СписаниеБезналичныхДенежныхСредств</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.НалоговаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.ОплатыЧеками</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияПоКассе</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателями</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСКонтрагентамиПрочие</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <attributes>
    <name>ВТомЧислеНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентДенежныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеДляПечати</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Приложение</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятоОт</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.TypesDePayment</types>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Чек</name>
    <type>
      <types>CatalogRef.БанковскиеЧеки</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаИз</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧОснования</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ВозвратПоставщику</types>
        <types>DocumentRef.НалоговаяНакладная</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>DocumentRef.ВозвратОтПокупателя</types>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>НесколькоСтавокНДС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РасшифровкаНДС</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/ПриходныйКассовыйОрдер/ManagerModule.bsl
#Область Печать

Процедура ПечатьПриходныйКассовыйОрдер(Док, Таб) Экспорт
	Таб.ТолькоПросмотр = Истина;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.АвтоМасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_ПриходныйКассовыйОрдер_ПриходныйКассовыйОрдер";
	КарточкаОрганизации = Справочники.Контрагенты.ПолучитьКарточку(Док.Организация, Док.Дата);
	Валюта = Справочники.Валюты.MoroccanDirham;
	Макет = Документы.ПриходныйКассовыйОрдер.ПолучитьМакет("ПриходныйКассовыйОрдер");	
	оШапка = Макет.ПолучитьОбласть("Шапка");
	оШапка.Параметры.ПредставлениеОрганизации = КарточкаОрганизации.Наименование;
	//оШапка.Параметры.ОрганизацияПоОКПО = КарточкаОрганизации.ОКПО;
	оШапка.Параметры.НомерДокумента = РаботаСДокументами.СформироватьЦифровойНомер(Док.Номер);
	оШапка.Параметры.ДатаДокумента = Формат(Док.Дата, "ДЛФ=DD");
	оШапка.Параметры.КодДебета = "50.01";
	оШапка.Параметры.Сумма = Док.Сумма;
	оШапка.Параметры.СуммаРубКоп = Док.Сумма;
	оШапка.Параметры.СуммаПрописью = Справочники.Валюты.СформироватьСуммуПрописью(Док.Сумма, Валюта, Перечисления.Локализации.fr_CA);
	оШапка.Параметры.ПринятоОт = Док.ПринятоОт;
	оШапка.Параметры.Основание = Док.ОснованиеДляПечати;
	оШапка.Параметры.Приложение = Док.Приложение;
	оШапка.Параметры.ВТомЧисле = Док.ВТомЧислеНДС;
	оШапка.Параметры.ФИОГлавногоБухгалтера = КарточкаОрганизации.ГлавныйБухгалтер.ДляПечати;
	оШапка.Параметры.ФИОКассира = Справочники.ФизическиеЛица.СформироватьПредставлениеДляПечати(Док.Кассир);
	Таб.Вывести(оШапка);
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
КонецПроцедуры

Function ПечатьЧека(Док, Spreadsheet) Export
	Template = Документы.ПриходныйКассовыйОрдер.ПолучитьМакет("Ticket");
	
	Header = Template.GetArea("Шапка");
	
	Header.Parameters.Fill(Док);
	
	FieldPhoto = Док.Организация.Логотип.Get();
	Try
		Header.Drawings[0].Picture = New Picture(FieldPhoto);
	Except
	EndTry;
	
	Header.Parameters.КонтрагентЗаголовок = ?(ЗначениеЗаполнено(Док.Контрагент), НСтр("fr = 'Payeur'; ru = 'Плательщик'; en = 'The payer'; es = 'Pagador'"), "");
	Header.Parameters.Контрагент = ?(ЗначениеЗаполнено(Док.Контрагент), Док.Контрагент, "");

	Spreadsheet.Put(Header);
	
	Spreadsheet.PutHorizontalPageBreak();
	
	Return Spreadsheet;
	
	//}}
EndFunction

#КонецОбласти
